//================================================
//
// プレイヤーの状態 [playerstate.cpp]
// Author: YUTO YOSHIDA
//
//================================================

//************************************************
// インクルードファイル
//************************************************
#include "playerstate.h"
#include"motion.h"
#include"player.h"
#include"explosion.h"
//================================================
// コンストラクタ
//================================================
CPlayerState::CPlayerState()
{
	m_pPlayer = nullptr;
}

//================================================
// デストラクタ
//================================================
CPlayerState::~CPlayerState()
{
}

//================================================
// コンストラクタ(ニュートラル)
//================================================
CPlayerNeutral::CPlayerNeutral()
{
}

//================================================
// デストラクタ(ニュートラル)
//================================================
CPlayerNeutral::~CPlayerNeutral()
{
}

//================================================
// 更新処理(ニュートラル)
//================================================
void CPlayerNeutral::Update(void)
{

}

//================================================
// コンストラクタ(移動)
//================================================
CPlayerMove::CPlayerMove()
{
}

//================================================
// デストラクタ(移動)
//================================================
CPlayerMove::~CPlayerMove()
{
}

//================================================
// 更新処理(移動)
//================================================
void CPlayerMove::Update(void)
{
	// モーションの取得
	CMotion* pMotion = m_pPlayer->GetMotion();

	if (pMotion->GetEventFrame(m_pPlayer->MOTIONTYPE_MOVE))
	{
		CExplosion::Create(m_pPlayer->GetPos(),D3DXVECTOR3(50.0f,50.0f,0.0f),WHITE,4,3,10);
	}
}
